---
kind: property
id: P:Autodesk.Revit.DB.HostedSweep.HorizontalOffset
source: html/a7da1c98-55e0-b0eb-fbf4-165d7d424924.htm
---
# Autodesk.Revit.DB.HostedSweep.HorizontalOffset Property

Retrieve/set the horizontal offset of the hosted sweep object.

## Syntax (C#)
```csharp
public double HorizontalOffset { get; set; }
```